#pragma once

/* ------------------------------ 学习笔记 ------------------------------ *
Clean Code Principles：指的是代码容易阅读、理解和维护。

- 清晰性：	代码应该是容易阅读和理解的
- 简单性：	代码应该尽可能的简单，避免不必要的复杂性
- 注释：	谨慎使用注释，在代码复杂和不容易理解的情况下使用
- 命名：	变量、函数和类应该使用有意义和描述性性的文字
- 格式：	为了改善代码的可读性，编写统一格式的代码
- 功能性：	代码应该被组织成小的、单一用途的函数和类
- 错误处理：代码应该以一致和可预测的方式处理错误
- 测试：	代码应该是可测试的，并且具有很高的测试覆盖率
- 复用性：	代码应该被设计成可重用和模块化的
- 性能：	代码应该被设计成高性能的


Programming Paradigms：编程范式是使用一门编程语言来解决问题的一种方法。不同和的
	编程语言提供了不同的方法来组织代码。

- 命令式编程
- 函数式编程
- 面向对象编程
- 逻辑编程
- 声明式编程


*/


